In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [4]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ["Allen", 22, 175]

In [6]:
df

    Name  Age  Height
0  Allen   22     175

In [7]:
df.loc[2] = ["Ted", 25, 180]

In [8]:
df

    Name  Age  Height
0  Allen   22     175
2    Ted   25     180

In [9]:
df["Weight"] = [75, 80]

In [10]:
df

    Name  Age  Height  Weight
0  Allen   22     175      75
2    Ted   25     180      80

In [12]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   22     175
2    Ted   25     180

In [13]:
df

    Name  Age  Height  Weight
0  Allen   22     175      75
2    Ted   25     180      80

In [14]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Allen   22     175
2    Ted   25     180

In [15]:
df.drop(2)

    Name  Age  Height
0  Allen   22     175

In [16]:
df

    Name  Age  Height
0  Allen   22     175
2    Ted   25     180

In [17]:
df["Height"][2]

np.int64(180)

In [18]:
df["Height"][2] = 185
df

/tmp/ipykernel_10556/4231231635.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Height"][2] = 185
/tmp/ipykernel_10556/4231231635.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Height"][2] = 185

    Name  Age  Height
0  Allen   22     175
2    Ted   25     185

In [19]:
df.loc[2, "Height"] = 190
df

    Name  Age  Height
0  Allen   22     175
2    Ted   25     190

In [20]:
df["Name"]

0    Allen
2      Ted
Name: Name, dtype: object

In [21]:
columns = ["Nmae", "Age", "Height"]
data = [
    ["Allen", 22, 175],
    ["Ted", 25, 180],
]

df = pd.DataFrame(
    data=data,
    columns=columns,
)

df

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180

In [22]:
columns = ["Nmae", "Age", "Height"]
data = [
    ["Jack", 26, 177],
    ["Mary", 28, 170],
]

df2 = pd.DataFrame(
    data=data,
    columns=columns,
)

df2

   Nmae  Age  Height
0  Jack   26     177
1  Mary   28     170

In [23]:
pd.concat(
    [df, df2],
)

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180
0   Jack   26     177
1   Mary   28     170

In [24]:
df_concat = pd.concat(
    [df, df2],
)

df_concat

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180
0   Jack   26     177
1   Mary   28     170

In [26]:
df_concat.reset_index(drop=True)

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   26     177
3   Mary   28     170

In [28]:
df_concat = df_concat.reset_index(drop=True)

In [29]:
df_concat

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   26     177
3   Mary   28     170

In [30]:
df_concat = pd.concat(
    [df, df2],
).reset_index(drop=True)

df_concat

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   26     177
3   Mary   28     170

In [31]:
df_concat["Nmae"]

0    Allen
1      Ted
2     Jack
3     Mary
Name: Nmae, dtype: object

In [32]:
df_concat["Age"]

0    22
1    25
2    26
3    28
Name: Age, dtype: int64

In [33]:
df_concat

    Nmae  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   26     177
3   Mary   28     170

In [34]:
df_concat_2 = df_concat

In [35]:
df_concat_2["Age"][0] = 30

df_concat_2

/tmp/ipykernel_10556/4248711568.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_concat_2["Age"][0] = 30

    Nmae  Age  Height
0  Allen   30     175
1    Ted   25     180
2   Jack   26     177
3   Mary   28     170

In [36]:
df_concat

    Nmae  Age  Height
0  Allen   30     175
1    Ted   25     180
2   Jack   26     177
3   Mary   28     170

In [37]:
df_concat_2 = df_concat.copy()